cs373/notes.org
** Right Invariant Equivilance
   Def: An equivilance relation is called _right invariant_ or
   _concatenation invariant_ iff $x\sim y \implies \forall w \in
   \Sigma^{\star} xw\sim yw$
** Myhill-Nerod Theorem
   - _Claim_: The following statments are equivalent
    1) A is a regular language
    2) $\exists$ a right invariant equivilance relation that has a
      finite index, and $A=$ union of some of the equivilance classes
    3) $\stackrel{A}{\sim}$ is of finite index
   
   - _Proof_: $1\rightarrow 2$
    1) Let M be any DFA, $M=(Q,\Sigma,\delta,q_0,F)$ s.t. $A=L(M)$
    2) Let $\stackrel{A}{\sim}$ be define as in Right Invariant Equivilance
    3) The number of equivilance classes is $\leq |Q|$
    4) A is then the union of classes that correspond to F $\square$

   - _Proof_: $2\rightarrow 3$
    1) Show that the partition of $\Sigma^{\star}$ produced by a right
      invariant is a refinement of the parition induced by $\stackrel{A}{\sim}$
    2) Since $\sim$ is right invariant, $\forall z\in
       \Sigma^{\star},xz\sim yz$ which implies that $xz\in A$ iff $yz
       \in A$ which by definition implies $x\stackrel{A}{\sim} y$
   - _Proof_: $3\rightarrow 1$
    1) Construct a DFA using $\stackrel{A}{\sim}$
    2) Let $Q \equiv$ set of equivilance classes of $\stackrel{A}{\sim}$
    3) Let $[x]\in \Sigma^{\star}, [x]\in Q$, denote the equivilance
       class that x belongs to
    4) Let $\delta([x],a)\equiv [xa]$, by def of $\stackrel{A}{\sim}$
    5) Let $q_0 \equiv [\epsilon]$ and $F\equiv{[x] : x\in A}$
* Context Free Langagues
** Formal Definition:
   1. $(V,\Sigma, R, S)$
      1. $V =$ Finite set of _variables_ or "non-terminals"
      2. \Sigma =  finite set of _terminals_
	 1. $\Sigma \cap V = \emptyset$
	 2. Convention: Variables are uppercase, symbols are lowercase
      3. R = finite set of _rules_ or "subsitution rules" or "productions"
	 1.Rules: examples
	    1. $A \rightarrow aaBc | a$
	       1. This means the for an A you can replace it with aaBc or a
	    2. $A \Rightarrow OA1 \Rightarrow 00A11 \Rightarrow 001A011 \Rightarrow 001011$
      4. S is the _start variable_
   2. $L(G) = \{w\in \Sigma^{\star} | S \productionstar w\}$
   3. Notation:
      1. Variables: A,B,C...
      2. Terminal: a,b,c,...0,1,$\epsilon$
      3. $U \productionstar V$ is defined as $\exists$ sequence
         $U_1..U_k$ , s.t. $U \Rightarrow U_1 \Rightarrow  U_2
         \Rightarrow ... \Rightarrow U_k \rightarrow V$
** Chomsky Normal form (CNF)
   - All rules have the form
     - $A\rightarrow BC$, where $B,C$ cannot be $S$
     - $A\rightarrow a$
     - if $A\rightarrow \epsilon$ then $A = S$
   - Lemma: Any CFG can be written in CNF
** Deterministic Push Down Automotas
   - $M = (Q,\Sigma, \Gamma, \delta, q_0, F)$
     - $\delta: Q \times \Sigma_\epsilon \times \Gamma_\epsilon
       \rightarrow Q \times \Gamma_\epsilon$
** Non-Deterministic Push Down Automotas (PDA)
   - $M = (Q,\Sigma, \Gamma, \delta, q_0, F)$
     - $\delta: Q \times \Sigma_\epsilon \times \Gamma_\epsilon
       \rightarrow Pow(Q \times \Gamma_\epsilon)$
** Relating PDA to CFL
   - A language is context free iff $\exists$ a PDA that recognizes it
     - Lemma: If A is CF, then $\exists$ a PDA,$M$, s.t. $A = L(M)$
     - Lemma: $\forall$ PDA, $M$, $\exists$ CFL, $G$, s.t. $L(G)=L(M)$
       - Proof Idea: Make a conical PDA (while preserving acceptance)
         as follows
	 1. 1 accept states
	 2. Stack is empty when accepting
	 3. Every transition either push or pops but not both

** Pumping Lemma for CFL's
   _Theorem_: If A is a CFL, then $\exists p \geq 0, p\in\mathbb{Z}
   s.t. \forall s\in A : |S| \geq p \implies \exists$ a paritition
   $s=uvxyz$ that satisfy the follow conditions 

   1) $\forall i \geq 0, uv^ixy^iz \in A$
   2) $|vy| > 0$
   3) $|vxy| \leq p$

   _Proof_:
   1) Let G be a CFG s.t. $A=L(G)$
   2) Let $b$ be the max length of the right side of a rule $\in R$
      and assume $b \geq 2$
      1) If $b < 2$ the language must be finite thus the pumping lemma
         is trivially true
   3) Consider the derivation tree if the tree height is $h$, then the
      length of the generated string,s, $\leq b^h$
   4) Let p = b^{|V|+1}, where $V =$ set of variables
   5) Observe that for any $s\in A$ that $|S| \geq p \implies h
      \geq |v|+1$
   6) Choose the 'smallest' derivation tree by height for s
   7) The longest path has length $|v|+1$ and vists $|v|+2$ variables
   8) Note that $|v|<$ variables visted, thus by the *Pidgen Hole
      Principle* there must be at least 1 variable repeated
   9) Thus There is a cycle in the production process strings which
      can then be repeated an indefiniate amount of times in the form
      $uv^ixy^iz \square$
** Closure Properties of CFL's
   1) $A_1 \cap A_2$
   2) $A_1 \cdot A_2$
   3) $A_1^{\star}$
   4) Closure under substituion
*** Theorems for Closure
    Let $G_i = (V_i, \Sigma_i, R_i, S_i)$ for $i=1,2$ and $A_i = L(G_i)$ \\
    Without loss of generality, assume $V_1 \cap V_2 = \emptyset \wedge
    S_3$
    
**** Theorem: If A_1 and A_2 are CFL's, then A_1 \cup A_2 is a CFL
Proof:
    1) Let $G_i = (V_i, \Sigma_i, R_i, S_i)$ for $i=1,2$ and $A_i = L(G_i)$
    2) Without loss of generality, assume $V_1 \cap V_2 = \emptyset \wedge S_3 \notin V_1 \cup V_2$
    3) Construct $G_3 = (V_1 \cup V_2 \cup \{S_3\}, \Sigma_1 \cup
       \Sigma_2, R_3, S_3)$ with $R_3= R_1 \cup R_2 \cup \{S_3 \rightarrow S_1|S_2\}. \square$
**** Theorem: If A_1 and A_2 are CFL's then A_1 \cdot A_2 is a CFL
     Proof:     
     1) $\notin V_1 \cup V_2$
     2) Construct $G_3 = (V_1 \cup V_2 \cup \{S_3\}, \Sigma_1 \cup
        \Sigma_2, R_1 \cup R_2 \cup \{S_3 \rightarrow S_1 S_2\}, S_3)$
**** Theorem: If A_1 and A_2 are CFL's then  A_1^{\star} is a CFL
     Proof:
     Construct $G_3 = (V_1 \cup \{S_3\}, \Sigma_1, R_1 \cup \{S_2 \rightarrow S_1 S_2 | \epsilon \})$
** CYK algorithm
*** Dynamic Programming (sequential optimization)
    - Richard Bellman 1950
    - sequential decision making
    - extensive form games
    - optimal control theory
    - Dijkstra's Algorithm

