cs373/notes.tex
\subsection{Right Invariant Equivilance}
\label{sec-2.9}

   Def: An equivilance relation is called \underline{right invariant} or
   \underline{concatenation invariant} iff $x\sim y \implies \forall w \in
   \Sigma^{\star} xw\sim yw$
\subsection{Myhill-Nerod Theorem}
\label{sec-2.10}

\begin{itemize}
\item \underline{Claim}: The following statments are equivalent

\begin{enumerate}
\item A is a regular language
\item $\exists$ a right invariant equivilance relation that has a
      finite index, and $A=$ union of some of the equivilance classes
\item $\stackrel{A}{\sim}$ is of finite index
\end{enumerate}

\end{itemize}
   
\begin{itemize}
\item \underline{Proof}: $1\rightarrow 2$

\begin{enumerate}
\item Let M be any DFA, $M=(Q,\Sigma,\delta,q_0,F)$ s.t. $A=L(M)$
\item Let $\stackrel{A}{\sim}$ be define as in Right Invariant Equivilance
\item The number of equivilance classes is $\leq |Q|$
\item A is then the union of classes that correspond to F $\square$
\end{enumerate}

\item \underline{Proof}: $2\rightarrow 3$

\begin{enumerate}
\item Show that the partition of $\Sigma^{\star}$ produced by a right
      invariant is a refinement of the parition induced by $\stackrel{A}{\sim}$
\item Since $\sim$ is right invariant, $\forall z\in
       \Sigma^{\star},xz\sim yz$ which implies that $xz\in A$ iff $yz
       \in A$ which by definition implies $x\stackrel{A}{\sim} y$
\end{enumerate}

\item \underline{Proof}: $3\rightarrow 1$

\begin{enumerate}
\item Construct a DFA using $\stackrel{A}{\sim}$
\item Let $Q \equiv$ set of equivilance classes of $\stackrel{A}{\sim}$
\item Let $[x]\in \Sigma^{\star}, [x]\in Q$, denote the equivilance
       class that x belongs to
\item Let $\delta([x],a)\equiv [xa]$, by def of $\stackrel{A}{\sim}$
\item Let $q_0 \equiv [\epsilon]$ and $F\equiv{[x] : x\in A}$
\end{enumerate}

\end{itemize}
\section{Context Free Langagues}
\label{sec-3}

\subsection{Formal Definition:}
\label{sec-3.1}

\begin{enumerate}
\item $(V,\Sigma, R, S)$

\begin{enumerate}
\item $V =$ Finite set of \underline{variables} or ``non-terminals''
\item $\Sigma$ =  finite set of \underline{terminals}

\begin{enumerate}
\item $\Sigma \cap V = \emptyset$
\item Convention: Variables are uppercase, symbols are lowercase
\end{enumerate}

\item R = finite set of \underline{rules} or ``subsitution rules'' or ``productions''
         1.Rules: examples

\begin{enumerate}
\item $A \rightarrow aaBc | a$

\begin{enumerate}
\item This means the for an A you can replace it with aaBc or a
\end{enumerate}

\item $A \Rightarrow OA1 \Rightarrow 00A11 \Rightarrow 001A011 \Rightarrow 001011$
\end{enumerate}

\item S is the \underline{start variable}
\end{enumerate}

\item $L(G) = \{w\in \Sigma^{\star} | S \productionstar w\}$
\item Notation:

\begin{enumerate}
\item Variables: A,B,C\ldots{}
\item Terminal: a,b,c,\ldots{}0,1,$\epsilon$
\item $U \productionstar V$ is defined as $\exists$ sequence
         $U_1..U_k$ , s.t. $U \Rightarrow U_1 \Rightarrow  U_2
         \Rightarrow ... \Rightarrow U_k \rightarrow V$
\end{enumerate}

\end{enumerate}
\subsection{Chomsky Normal form (CNF)}
\label{sec-3.2}

\begin{itemize}
\item All rules have the form

\begin{itemize}
\item $A\rightarrow BC$, where $B,C$ cannot be $S$
\item $A\rightarrow a$
\item if $A\rightarrow \epsilon$ then $A = S$
\end{itemize}

\item Lemma: Any CFG can be written in CNF
\end{itemize}
\subsection{Deterministic Push Down Automotas}
\label{sec-3.3}

\begin{itemize}
\item $M = (Q,\Sigma, \Gamma, \delta, q_0, F)$

\begin{itemize}
\item $\delta: Q \times \Sigma_\epsilon \times \Gamma_\epsilon
       \rightarrow Q \times \Gamma_\epsilon$
\end{itemize}

\end{itemize}
\subsection{Non-Deterministic Push Down Automotas (PDA)}
\label{sec-3.4}

\begin{itemize}
\item $M = (Q,\Sigma, \Gamma, \delta, q_0, F)$

\begin{itemize}
\item $\delta: Q \times \Sigma_\epsilon \times \Gamma_\epsilon
       \rightarrow Pow(Q \times \Gamma_\epsilon)$
\end{itemize}

\end{itemize}
\subsection{Relating PDA to CFL}
\label{sec-3.5}

\begin{itemize}
\item A language is context free iff $\exists$ a PDA that recognizes it

\begin{itemize}
\item Lemma: If A is CF, then $\exists$ a PDA,$M$, s.t. $A = L(M)$
\item Lemma: $\forall$ PDA, $M$, $\exists$ CFL, $G$, s.t. $L(G)=L(M)$

\begin{itemize}
\item Proof Idea: Make a conical PDA (while preserving acceptance)
         as follows

\begin{enumerate}
\item 1 accept states
\item Stack is empty when accepting
\item Every transition either push or pops but not both
\end{enumerate}

\end{itemize}

\end{itemize}

\end{itemize}
\subsection{Pumping Lemma for CFL's}
\label{sec-3.6}

   \underline{Theorem}: If A is a CFL, then $\exists p \geq 0, p\in\mathbb{Z}
   s.t. \forall s\in A : |S| \geq p \implies \exists$ a paritition
   $s=uvxyz$ that satisfy the follow conditions 

\begin{enumerate}
\item $\forall i \geq 0, uv^ixy^iz \in A$
\item $|vy| > 0$
\item $|vxy| \leq p$
\end{enumerate}
   \underline{Proof}:
\begin{enumerate}
\item Let G be a CFG s.t. $A=L(G)$
\item Let $b$ be the max length of the right side of a rule $\in R$
      and assume $b \geq 2$

\begin{enumerate}
\item If $b < 2$ the language must be finite thus the pumping lemma
         is trivially true
\end{enumerate}

\item Consider the derivation tree if the tree height is $h$, then the
      length of the generated string,s, $\leq b^h$
\item Let p = b$^{\mathrm{|V|+1}}$, where $V =$ set of variables
\item Observe that for any $s\in A$ that $|S| \geq p \implies h
      \geq |v|+1$
\item Choose the `smallest' derivation tree by height for s
\item The longest path has length $|v|+1$ and vists $|v|+2$ variables
\item Note that $|v|<$ variables visted, thus by the \textbf{Pidgen Hole       Principle} there must be at least 1 variable repeated
\item Thus There is a cycle in the production process strings which
      can then be repeated an indefiniate amount of times in the form
      $uv^ixy^iz \square$
\end{enumerate}
\subsection{Closure Properties of CFL's}
\label{sec-3.7}

\begin{enumerate}
\item $A_1 \cap A_2$
\item $A_1 \cdot A_2$
\item $A_1^{\star}$
\item Closure under substituion
\end{enumerate}
\subsubsection{Theorems for Closure}
\label{sec-3.7.1}

    Let $G_i = (V_i, \Sigma_i, R_i, S_i)$ for $i=1,2$ and $A_i = L(G_i)$ \\
    Without loss of generality, assume $V_1 \cap V_2 = \emptyset \wedge
    S_3$
    
\begin{itemize}

\item Theorem: If A$_1$ and A$_2$ are CFL's, then A$_1$ $\cup$ A$_2$ is a CFL\\
\label{sec-3.7.1.1}

Proof:
\begin{enumerate}
\item Let $G_i = (V_i, \Sigma_i, R_i, S_i)$ for $i=1,2$ and $A_i = L(G_i)$
\item Without loss of generality, assume $V_1 \cap V_2 = \emptyset \wedge S_3 \notin V_1 \cup V_2$
\item Construct $G_3 = (V_1 \cup V_2 \cup \{S_3\}, \Sigma_1 \cup
       \Sigma_2, R_3, S_3)$ with $R_3= R_1 \cup R_2 \cup \{S_3 \rightarrow S_1|S_2\}. \square$
\end{enumerate}

\item Theorem: If A$_1$ and A$_2$ are CFL's then A$_1$ \cdot A$_2$ is a CFL\\
\label{sec-3.7.1.2}

     Proof:     
\begin{enumerate}
\item $\notin V_1 \cup V_2$
\item Construct $G_3 = (V_1 \cup V_2 \cup \{S_3\}, \Sigma_1 \cup
        \Sigma_2, R_1 \cup R_2 \cup \{S_3 \rightarrow S_1 S_2\}, S_3)$
\end{enumerate}

\item Theorem: If A$_1$ and A$_2$ are CFL's then  A$_1$$^{\star}$ is a CFL\\
\label{sec-3.7.1.3}

     Proof:
     Construct $G_3 = (V_1 \cup \{S_3\}, \Sigma_1, R_1 \cup \{S_2 \rightarrow S_1 S_2 | \epsilon \})$
\end{itemize} % ends low level
\subsection{CYK algorithm}
\label{sec-3.8}

\subsubsection{Dynamic Programming (sequential optimization)}
\label{sec-3.8.1}

\begin{itemize}
\item Richard Bellman 1950
\item sequential decision making
\item extensive form games
\item optimal control theory
\item Dijkstra's Algorithm
\end{itemize}
