cs373/notes.org
*** Algorithm
    Is $G \productionstar$ w true or false?
   
    $G = (V, \Sigma, R, S)$,
    Put G into Chomsky Normal Form,
    $w \in \Sigma^{ \star }$

    Cocke, Schwartz, Younger, Kasame
  
#+BEGIN_SRC python
  """
  Preconditions:
  let the input be a string S consisting of n characters: a1 ... an.
  let the grammar contain r nonterminal symbols R1 ... Rr.
  This grammar contains the subset Rs which is the set of start symbols.
  let P[n,n,r] be an array of booleans. Initialize all elements of P to false.
  """
  
  for each i = 1 to n:
      for each unit production Rj -> ai:
          P[i][1][j] = true
  for each i = 2 to n: # Length of span
      for j in range(1,n-i+2): # Start of span
          for k in range(1,i): # Partition of span
              A = filter(RA -> RB RC, G) # A = list of productions s.t. RA -> RB RC
              for production in A:
                  if P[j][k][B] and P[j+k][i-k][C]:
                      P[j][i][A] = True
  if any P[1][n]: #x is iterated over the set s, where s are all the indices for Rs)
      print 'S is member of language'
  else:
      print 'S is not member of language'
#+END_SRC
* Context Sensitive Languages
** Formal Definition:  Non-Contracting Grammars
   $G=(V,\Sigma,R,S)$
   1) V is finite set of _variables_
   2) \Sigma  is a finite set of _terminals_ and $\Sigma\capV=
      \emptyset$
   4)  $\alpha\rightarrow\beta$
   5)  $|\alpha|\leq|\beta|$

** Normal Form Definition
   3) R is a finite set of rules of the form $\alpha A\beta
      \rightarrow\alpha\gamma\beta$ in which $A$ is a variable and
      $\alpha,\beta,\gamma$ are strings of terminals and variables.

      - $\alpha,\beta\in(V\cup\Sigma)^{\star}$
      - $\gamma\in(V\cup\Sigma)^{\star}-{\epsilon}$

   4) $S\in V$ is the start _variable_

   5) One additional rule allowed $S\rightarrow \epsilon$ and $S$ is not on the right side of any rule
** Linear Bounded Automaton
*** Informal Definition
    Has no stack but can read/write anywhere on the input string
* Turing Machines
** Formal Def
   A _Turing Machine_ is a 7-tuple $(Q,\Sigma,\Gamma,\delta,q_0,
   q_{accept},q _{reject})$ with $Q\Sigma,\Gamma\equiv$ non empty sets

   - Q is set of _states_
   - \Sigma is the _input alphabet_, which does not contain the blank
     symbol \_
   - \Gamma is the _tape alphabet_, in which $\_\in\Gamma$ and $\Sigma
     \subset\Gamma$
   - \delta : $Q\times\Gamma\rightarrow Q\times\Gamma\times
     \{L,R\}$ is the _transition function_
   - $q_0\in Q$ is the _start state_
   - $q_{accept}\in Q$ is the _accept state_
   - $q_{reject}\in Q$ is the _reject state_
   - $q_{accept}\neq q_{reject}$
** Configurations
   A configuration of the turing machine $\equiv c_i =(q_i,p_i,t_i)$,
   where $q_i \in Q,p_i$ is the head pos, and $t_i\in \Gamma^{\star}$
   is the tape contents.

   Notice that configurations are unique, and from them given the next
   input symbol one can determine the next configuration. i.e.
   \begin{equation}
   \delta(q_i,\gamma_i):(c_i,\gamma_i) \mapsto
   (q_{i+1},p_{i+1},D_{i+1}) \mapsto c_{i+1}
   \end{equation}
   for $D_{i+1}\in \{L,R\}$
   
*** Halting Configs
    If either of the following type of configs is encountered, the turning
    machine halts and returns 'accept' or 'reject' respectively.
**** Accept Config
     \begin{equation}
     c_{accept} \iff q_i = q_{accept}
     \end{equation}
**** Reject Config
     \begin{equation}
     c_{reject} \iff q_i = q_{reject}
     \end{equation}

** Turning Recognizable
   M is _Recognizable_ iff $\forall w \in L, M$
   accepts
** Turing Decidable
   M, is _Decidable_ iff $\forall w \in L, M$ accepts _and_
   $\forall w \notin L, M$ rejects
*** Co-Recognizablity
    1. Define: $Sigma^{\star} - A = \bar{A}$ is recognizable
**** Decidablility Theorem:
     1. A language is only Turing Decidable iff it is both recognizable
	and co-recognizable
     2. If a language is not decidable then its compliment is not recognizable
** Turing Machine Variants:
   Note that none of these add any power
   
   - Multi-Tape: $\delta:Q\times\Gamma^k\rightarrow Q\times\Gamma^k\times\{L,R\}^k$
     - Emulate on single tape by striping and recording/marking virtual head position
   - Adding Stay: $\delta:Q\times\Gamma\rightarrow Q\times\Gamma\times\{L,R,S\}$ where S doesn't move the head
     - Emulate by moving left and then right while not changing tape contents
   - Non-Deterministic:
** Universial Turing Machine
   Turing machine that take a turing machine, M, as a string encoding
   denoted as $\langle M \rangle$

** Undecidability
*** Halting Problem
    1. Theorem: $A_{TM}$ is not Turing Decidable
    2. Proof by Contradiction:
       1. Suppose $A_{TM}$ were decidable.
       2. Let H be a TM that decides $A_{TM}$
	  1. $H(\langle M, w \rangle) =$ 
	     1. accept if $w \in L(M)$
	     2. reject if $w \notin L(M)$
       3. Construct a TM, D, which uses H and give the opposite result
	  1. $D \equiv$ on input $\langle M \rangle$, in which M is a
             T.M
	     1. Run H on input $\langle M, \langle M \rangle \rangle$
	     2. Return the opposite of what H outputs
       4. Therefore  $D(\langle M \rangle):$
	  1. accept if M rejects $\langle M\rangle$
	  2. reject if M accepts $\langle M\rangle$
       5. Note that this implies $D(\langle D \rangle):$
	1. accept if D rejects $\langle D\rangle$
	2. reject if D accepts $\langle D\rangle$
       6. Notice that this is a contradiction, thus H and D cannot exist

** Reduction
   Using a language that is known to be undecidable prove that another
   language is not undecidable.

*** Map Reductions
**** Computable Functions
     A function $f:\Sigma^{\star} \rightarrow \Sigma^{\star}$ is
     called _computable_ iff $\exists$ a TM, M, s.t. M halts $\forall
     w\in \Sigma^{\star}$, and after halting, $f(w)$ appears alone on
     the tape.
**** Mapping reducible
     A language A is called _mapping reducible_ to language B, written
     $A \leq_M B$ iff: 
     \begin{equation}
     \exists (f: \Sigma^{\star} \rightarrow
     \Sigma^{\star})
     , \forall w \in \Sigma^{\star} : [w \in A \iff
     f(w) \in B ]
     \end{equation}
***** Theorems
      1. Note the rule of thumb for these theorems is that $\leq_M$
         more or less reflects the Chomsky Heirarchy:
      2. \textbf{Theorem}: $[A\leq_M B] \implies$ [If B is Turing Decidable, then A is
         turing Decidable]
      3. \textbf{Collary}: $[A\leq_M B] \implies$ [If A is Turing Undecidable, then B
         is Turing Undecidable]
      4. \textbf{Theorem}: $[A\leq_M B] \implies$ [If B is Turing
         Recognizable then A is Turing Recognizable]
      5. \textbf{Collary}: $[A\leq_M B] \implies$ [If A is Turing
         Unrecognizable then B is Turing Unrecognizable]
*** Rice's Theorem:
    1. If P is a set of TM's with a property that satisfies:
       1. $\forall$ TM's $M$ and $M_2$ s.t. $L(M_1) = L(M_2)$,
          $\langle M_1 \rangle \in P$ iff $\langle M_2 \rangle \in P$
       2. $\exists$ TM M_1 and M_2 for which $\langle M_1 \rangle \in
          P$ and $\langle M_2 \rangle \notin P$
    2. Then the language of P is _not_ Turing Decidable
