cs373/notes.tex
\subsubsection{Algorithm}
\label{sec-3.8.2}

    Is $G \productionstar$ w true or false?
   
    $G = (V, \Sigma, R, S)$,
    Put G into Chomsky Normal Form,
    $w \in \Sigma^{ \star }$

    Cocke, Schwartz, Younger, Kasame
  

\begin{verbatim}
"""
Preconditions:
let the input be a string S consisting of n characters: a1 ... an.
let the grammar contain r nonterminal symbols R1 ... Rr.
This grammar contains the subset Rs which is the set of start symbols.
let P[n,n,r] be an array of booleans. Initialize all elements of P to false.
"""

for each i = 1 to n:
    for each unit production Rj -> ai:
        P[i][1][j] = true
for each i = 2 to n: # Length of span
    for j in range(1,n-i+2): # Start of span
        for k in range(1,i): # Partition of span
            A = filter(RA -> RB RC, G) # A = list of productions s.t. RA -> RB RC
            for production in A:
                if P[j][k][B] and P[j+k][i-k][C]:
                    P[j][i][A] = True
if any P[1][n]: #x is iterated over the set s, where s are all the indices for Rs)
    print 'S is member of language'
else:
    print 'S is not member of language'
\end{verbatim}


\section{Context Sensitive Languages}
\label{sec-4}

\subsection{Formal Definition:  Non-Contracting Grammars}
\label{sec-4.1}

   $G=(V,\Sigma,R,S)$
\begin{enumerate}
\item V is finite set of \underline{variables}
\item $\Sigma$  is a finite set of \underline{terminals} and $\Sigma\capV=
      \emptyset$
\item $\alpha\rightarrow\beta$
\item $|\alpha|\leq|\beta|$
\end{enumerate}
\subsection{Normal Form Definition}
\label{sec-4.2}

   3) R is a finite set of rules of the form $\alpha A\beta
      \rightarrow\alpha\gamma\beta$ in which $A$ is a variable and
      $\alpha,\beta,\gamma$ are strings of terminals and variables.

\begin{enumerate}
\item $\alpha,\beta\in(V\cup\Sigma)^{\star}$
\item $\gamma\in(V\cup\Sigma)^{\star}-{\epsilon}$
\item $S\in V$ is the start \underline{variable}
\item One additional rule allowed $S\rightarrow \epsilon$ and $S$ is not on the right side of any rule
\end{enumerate}
\subsection{Linear Bounded Automaton}
\label{sec-4.3}

\subsubsection{Informal Definition}
\label{sec-4.3.1}

    Has no stack but can read/write anywhere on the input string
\section{Turing Machines}
\label{sec-5}

\subsection{Formal Def}
\label{sec-5.1}

   A \underline{Turing Machine} is a 7-tuple $(Q,\Sigma,\Gamma,\delta,q_0,
   q_{accept},q _{reject})$ with $Q\Sigma,\Gamma\equiv$ non empty sets

\begin{itemize}
\item Q is set of \underline{states}
\item $\Sigma$ is the \underline{input alphabet}, which does not contain the blank
     symbol \_
\item $\Gamma$ is the \underline{tape alphabet}, in which $\_\in\Gamma$ and $\Sigma
     \subset\Gamma$
\item $\delta$ : $Q\times\Gamma\rightarrow Q\times\Gamma\times
     \{L,R\}$ is the \underline{transition function}
\item $q_0\in Q$ is the \underline{start state}
\item $q_{accept}\in Q$ is the \underline{accept state}
\item $q_{reject}\in Q$ is the \underline{reject state}
\item $q_{accept}\neq q_{reject}$
\end{itemize}
\subsection{Configurations}
\label{sec-5.2}

   A configuration of the turing machine $\equiv c_i =(q_i,p_i,t_i)$,
   where $q_i \in Q,p_i$ is the head pos, and $t_i\in \Gamma^{\star}$
   is the tape contents.

   Notice that configurations are unique, and from them given the next
   input symbol one can determine the next configuration. i.e.
   \begin{equation}
   \delta(q_i,\gamma_i):(c_i,\gamma_i) \mapsto
   (q_{i+1},p_{i+1},D_{i+1}) \mapsto c_{i+1}
   \end{equation}
   for $D_{i+1}\in \{L,R\}$
   
\subsubsection{Halting Configs}
\label{sec-5.2.1}

    If either of the following type of configs is encountered, the turning
    machine halts and returns `accept' or `reject' respectively.
\begin{itemize}

\item Accept Config\\
\label{sec-5.2.1.1}

     \begin{equation}
     c_{accept} \iff q_i = q_{accept}
     \end{equation}

\item Reject Config\\
\label{sec-5.2.1.2}

     \begin{equation}
     c_{reject} \iff q_i = q_{reject}
     \end{equation}

\end{itemize} % ends low level
\subsection{Turning Recognizable}
\label{sec-5.3}

   M is \underline{Recognizable} iff $\forall w \in L, M$
   accepts
\subsection{Turing Decidable}
\label{sec-5.4}

   M, is \underline{Decidable} iff $\forall w \in L, M$ accepts \underline{and}
   $\forall w \notin L, M$ rejects
\subsubsection{Co-Recognizablity}
\label{sec-5.4.1}

\begin{enumerate}
\item Define: $Sigma^{\star} - A = \bar{A}$ is recognizable
\end{enumerate}
\begin{itemize}

\item Decidablility Theorem:\\
\label{sec-5.4.1.1}

\begin{enumerate}
\item A language is only Turing Decidable iff it is both recognizable
        and co-recognizable
\item If a language is not decidable then its compliment is not recognizable
\end{enumerate}
\end{itemize} % ends low level
\subsection{Turing Machine Variants:}
\label{sec-5.5}

   Note that none of these add any power
   
\begin{itemize}
\item Multi-Tape: $\delta:Q\times\Gamma^k\rightarrow Q\times\Gamma^k\times\{L,R\}^k$

\begin{itemize}
\item Emulate on single tape by striping and recording/marking virtual head position
\end{itemize}

\item Adding Stay: $\delta:Q\times\Gamma\rightarrow Q\times\Gamma\times\{L,R,S\}$ where S doesn't move the head

\begin{itemize}
\item Emulate by moving left and then right while not changing tape contents
\end{itemize}

\item Non-Deterministic:
\end{itemize}
\subsection{Universial Turing Machine}
\label{sec-5.6}

   Turing machine that take a turing machine, M, as a string encoding
   denoted as $\langle M \rangle$

\subsection{Undecidability}
\label{sec-5.7}

\subsubsection{Halting Problem}
\label{sec-5.7.1}

\begin{enumerate}
\item Theorem: $A_{TM}$ is not Turing Decidable
\item Proof by Contradiction:

\begin{enumerate}
\item Suppose $A_{TM}$ were decidable.
\item Let H be a TM that decides $A_{TM}$

\begin{enumerate}
\item $H(\langle M, w \rangle) =$

\begin{enumerate}
\item accept if $w \in L(M)$
\item reject if $w \notin L(M)$
\end{enumerate}

\end{enumerate}

\item Construct a TM, D, which uses H and give the opposite result

\begin{enumerate}
\item $D \equiv$ on input $\langle M \rangle$, in which M is a
             T.M

\begin{enumerate}
\item Run H on input $\langle M, \langle M \rangle \rangle$
\item Return the opposite of what H outputs
\end{enumerate}

\end{enumerate}

\item Therefore  $D(\langle M \rangle):$

\begin{enumerate}
\item accept if M rejects $\langle M\rangle$
\item reject if M accepts $\langle M\rangle$
\end{enumerate}

\item Note that this implies $D(\langle D \rangle):$

\begin{enumerate}
\item accept if D rejects $\langle D\rangle$
\item reject if D accepts $\langle D\rangle$
\end{enumerate}

\item Notice that this is a contradiction, thus H and D cannot exist
\end{enumerate}

\end{enumerate}
\subsection{Reduction}
\label{sec-5.8}

   Using a language that is known to be undecidable prove that another
   language is not undecidable.

\subsubsection{Map Reductions}
\label{sec-5.8.1}

\begin{itemize}

\item Computable Functions\\
\label{sec-5.8.1.1}

     A function $f:\Sigma^{\star} \rightarrow \Sigma^{\star}$ is
     called \underline{computable} iff $\exists$ a TM, M, s.t. M halts $\forall
     w\in \Sigma^{\star}$, and after halting, $f(w)$ appears alone on
     the tape.

\item Mapping reducible\\
\label{sec-5.8.1.2}

     A language A is called \underline{mapping reducible} to language B, written
     $A \leq_M B$ iff: 
     \begin{equation}
     \exists (f: \Sigma^{\star} \rightarrow
     \Sigma^{\star})
     , \forall w \in \Sigma^{\star} : [w \in A \iff
     f(w) \in B ]
     \end{equation}
\begin{itemize}

\item Theorems\\
\label{sec-5.8.1.2.1}

\begin{enumerate}
\item Note the rule of thumb for these theorems is that $\leq_M$
         more or less reflects the Chomsky Heirarchy:
\item \textbf{Theorem}: $[A\leq_M B] \implies$ [If B is Turing Decidable, then A is
         turing Decidable]
\item \textbf{Collary}: $[A\leq_M B] \implies$ [If A is Turing Undecidable, then B
         is Turing Undecidable]
\item \textbf{Theorem}: $[A\leq_M B] \implies$ [If B is Turing
         Recognizable then A is Turing Recognizable]
\item \textbf{Collary}: $[A\leq_M B] \implies$ [If A is Turing
         Unrecognizable then B is Turing Unrecognizable]
\end{enumerate}
\end{itemize} % ends low level
\end{itemize} % ends low level
\subsubsection{Rice's Theorem:}
\label{sec-5.8.2}

\begin{enumerate}
\item If P is a set of TM's with a property that satisfies:

\begin{enumerate}
\item $\forall$ TM's $M$ and $M_2$ s.t. $L(M_1) = L(M_2)$,
          $\langle M_1 \rangle \in P$ iff $\langle M_2 \rangle \in P$
\item $\exists$ TM M$_1$ and M$_2$ for which $\langle M_1 \rangle \in
          P$ and $\langle M_2 \rangle \notin P$
\end{enumerate}

\item Then the language of P is \underline{not} Turing Decidable
\end{enumerate}
