cs373/notes.org
* Kolmogorov Complexity
  - How 'Small'(state number) of a turing machine is needed to
    generate a given string

* Complexity Theory:
** Definition:
   1. \textbf{Time Complexity}: How many steps does a Turing machine take to decide?
   2. \textbf{Space Complexity}: How much space does a turing machine need on the tape to decide?
   3. Let $f(n) \equiv$ the max number of steps for a TM to decide w,
      with $n=|w|$
      1. $f(n) = O(g(n)) \iff \exists (c,n_0) \in \mathbb{R} \times \mathbb{Z}$ s.t. $\forall n \geq
         f(n), f(n) \leq c g(n)$
      2. Which is equivelent to: 
	 \begin{equation}
	 \forall w \in \Sigma^{\star}: \abs{w} \geq n_0 \iff f(\abs{w}) \leq c g(\abs{w})
	 \end{equation}
** Complexity Classes
   1. Let $t: \mathbb{N} \rightarrow \mathbb{N}$ be a function
   2. Let $D \equiv$ set of all decidable TMs
   3. Let $TIME[t(n)] \equiv {A \in D | \exists}$ a TM that decides A
      in $O(t(n))$ steps
*** P vs NP
**** P
     \begin{equation}
     P \equiv \cup_{k\in \mathbb{N}} TIME(n^k)
     \end{equation}
     2. Notice that $TIME(n^k) \subset TIME(n^{k+1})$
     3. Thus $P =$ all language for which $\exists$ a TM that decides
       	in polynomial time
**** NP
     \begin{equation}
     NP \equiv \cup_{k\in \mathbb{N}} NTIME(n^k)
     \end{equation}
     1. $NTIME(t(n)) \equiv \{A\in D | \exists$ a nondeterministic TM
        that decides A in $O(t(n))$ steps}
     2. Note that this appears to be equivlent to verification via bruteforce
	1. $\textbf{Satisfyability Problem}$:
	   A language $A\in NP \iff A$ is polinomially _verifiable_.
	   1. $A$ is _verifiable_ iff $\exists$ a poly-time DTM that
              takes input $w$ for $A$ and the _certificate_ $c$ and
              decides if $w \in A$ 
**** Million Dollar Question
     1. Does $P=NP$ ?
**** Hardest NP problems
     1. A Problem, P, is _NP-Complete_ iff:
	1. $P\in NP$
	2. $\forall A \in NP, A \leq_P P$
	   1. Where $\leq_P$ is a mapping reduction where $f$ is
              computable in polynomial time

