cs373/notes.tex
\section{Kolmogorov Complexity}
\label{sec-6}

\begin{itemize}
\item How `Small'(state number) of a turing machine is needed to
    generate a given string
\end{itemize}
\section{Complexity Theory:}
\label{sec-7}

\subsection{Definition:}
\label{sec-7.1}

\begin{enumerate}
\item \textbf{Time Complexity}: How many steps does a Turing machine take to decide?
\item \textbf{Space Complexity}: How much space does a turing machine need on the tape to decide?
\item Let $f(n) \equiv$ the max number of steps for a TM to decide w,
      with $n=|w|$

\begin{enumerate}
\item $f(n) = O(g(n)) \iff \exists (c,n_0) \in \mathbb{R} \times \mathbb{Z}$ s.t. $\forall n \geq
         f(n), f(n) \leq c g(n)$
\item Which is equivelent to: 
         \begin{equation}
         \forall w \in \Sigma^{\star}: \abs{w} \geq n_0 \iff f(\abs{w}) \leq c g(\abs{w})
         \end{equation}
\end{enumerate}

\end{enumerate}
\subsection{Complexity Classes}
\label{sec-7.2}

\begin{enumerate}
\item Let $t: \mathbb{N} \rightarrow \mathbb{N}$ be a function
\item Let $D \equiv$ set of all decidable TMs
\item Let $TIME[t(n)] \equiv {A \in D | \exists}$ a TM that decides A
      in $O(t(n))$ steps
\end{enumerate}
\subsubsection{P vs NP}
\label{sec-7.2.1}

\begin{itemize}

\item P\\
\label{sec-7.2.1.1}

     \begin{equation}
     P \equiv \cup_{k\in \mathbb{N}} TIME(n^k)
     \end{equation}
\begin{enumerate}
\item Notice that $TIME(n^k) \subset TIME(n^{k+1})$
\item Thus $P =$ all language for which $\exists$ a TM that decides
        in polynomial time
\end{enumerate}

\item NP\\
\label{sec-7.2.1.2}

     \begin{equation}
     NP \equiv \cup_{k\in \mathbb{N}} NTIME(n^k)
     \end{equation}
\begin{enumerate}
\item $NTIME(t(n)) \equiv \{A\in D | \exists$ a nondeterministic TM
        that decides A in $O(t(n))$ steps\}
\item Note that this appears to be equivlent to verification via bruteforce

\begin{enumerate}
\item $\textbf{Satisfyability Problem}$:
           A language $A\in NP \iff A$ is polinomially \underline{verifiable}.

\begin{enumerate}
\item $A$ is \underline{verifiable} iff $\exists$ a poly-time DTM that
              takes input $w$ for $A$ and the \underline{certificate} $c$ and
              decides if $w \in A$
\end{enumerate}

\end{enumerate}

\end{enumerate}

\item Million Dollar Question\\
\label{sec-7.2.1.3}

\begin{enumerate}
\item Does $P=NP$ ?
\end{enumerate}

\item Hardest NP problems\\
\label{sec-7.2.1.4}

\begin{enumerate}
\item A Problem, P, is \underline{NP-Complete} iff:

\begin{enumerate}
\item $P\in NP$
\item $\forall A \in NP, A \leq_P P$

\begin{enumerate}
\item Where $\leq_P$ is a mapping reduction where $f$ is
              computable in polynomial time
\end{enumerate}

\end{enumerate}

\end{enumerate}
\end{itemize} % ends low level

\end{document}